{
  "backend/main.mo": "Motoko canister implementing notes with attachment metadata, user profiles, and role‑based access control for submitting, viewing, and moderating notes.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading the main module.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, header, footer, theme provider, and profile‑setup modal.",
  "frontend/src/components/auth/AuthGate.tsx": "Route guard prompting unauthenticated users to sign in before accessing protected pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ModeratorGate.tsx": "Gate component restricting access to moderator‑only pages and showing an access‑denied state for non‑admins.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting authenticated users without a profile to enter their name and saves it via a mutation.",
  "frontend/src/components/empty-states/EmptyState.tsx": "Reusable empty‑state component displaying an illustration, title, description, and optional action.",
  "frontend/src/components/header/AppHeader.tsx": "Renders the top navigation bar with links, login button, and mobile menu, adapting options based on auth and admin status.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a page container with optional title/description and configurable max‑width.",
  "frontend/src/components/notes/NoteCard.tsx": "Displays a note preview card with title, subject, description, timestamps, attachments, and optional status badge.",
  "frontend/src/components/notes/NoteStatusBadge.tsx": "Shows a badge indicating whether a note is verified, rejected, or pending.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches whether the current caller is an admin using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and status tracking.",
  "frontend/src/hooks/useModeration.ts": "Supplies queries and mutations for moderation, including fetching pending notes and verifying or rejecting them.",
  "frontend/src/hooks/useOfflineSavedNotes.ts": "Manages locally stored offline notes per authenticated user, with functions to save, remove, and check notes.",
  "frontend/src/hooks/useQueries.ts": "Contains various note‑related queries and mutations, including fetching verified notes, submissions, profiles, and submitting or saving data.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying base styles to body and borders.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/moderation/ModeratorQueuePage.tsx": "Displays pending notes for moderators with metadata and navigation to individual review pages.",
  "frontend/src/pages/moderation/ModeratorReviewPage.tsx": "Moderator review page that loads a pending note, shows its details, and allows moderators to verify or reject it with an optional reason.",
  "frontend/src/pages/MySubmissionsPage.tsx": "Displays the user's submitted notes with loading states and an empty state that links to the submission page.",
  "frontend/src/pages/NoteDetailPage.tsx": "Fetches and displays detailed information about a note, including metadata, status, offline save options, and error handling.",
  "frontend/src/pages/OfflinePage.tsx": "Shows notes saved for offline access with loading placeholders and an empty state linking back to browsing.",
  "frontend/src/pages/PublicBrowsePage.tsx": "Lists verified notes with subject/unit filtering, loading states, and empty state messaging.",
  "frontend/src/pages/SubmitNotePage.tsx": "Provides a form for submitting new notes, including attachments, validation, and success/error handling.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, and managing persisted URL-based state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, features, requirements, and image needs."
}